<a href="https://colab.research.google.com/github/cinthia-cientistadedados/cinthia-cientistadedados/blob/main/duplicados.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
df = pd.read_csv('duplicado.txt')
df

   id     Nome  Idade       Cidade
0   1    Alice     30    Nova York
1   2      Bob     25  Los Angeles
2   3  Charlie     35      Chicago
3   4    Alice     30    Nova York

In [ ]:
duplicados = df.duplicated(['Nome'])
duplicados

0    False
1    False
2    False
3     True
dtype: bool

In [ ]:
df_unico = df.drop_duplicates(['Nome'])
print(df_unico.dtypes)

id         int64
Nome      object
Idade      int64
Cidade    object
dtype: object

In [ ]:
df_unico()

In [ ]:
df = pd.read_csv('correcao.txt')
df

   id     Nome Idade       Cidade
0   1    Alice  '30'    Nova York
1   2      Bob  '25'  Los Angeles
2   3  Charlie  '35'      Chicago

In [ ]:
print(df.dtypes)

id         int64
Nome      object
Idade     object
Cidade    object
dtype: object

In [ ]:
df['Idade'] = df['Idade'].astype(int)
df

   id     Nome  Idade       Cidade
0   1    Alice     30    Nova York
1   2      Bob     25  Los Angeles
2   3  Charlie     35      Chicago

In [ ]:
print(df.dtypes)

id         int64
Nome      object
Idade      int32
Cidade    object
dtype: object